package kot

fun main() {
    val month: String = "Март";
    val monthIndex: Int = 10;
    var season: String;
    when(month){
        "Январь", "Февраль", "Декабрь" -> {season = "Зима"}
        "Март", "Апрель", "Май" -> {season = "Весна"}
        "Июнь", "Июль", "Август" -> {season = "Лето"}
        "Сентябрь", "Октябрь", "Ноябрь" -> {season = "Осень"}
        else -> {season = "Некоректный месяц"}
    }


    season = when(month){
        "Январь", "Февраль", "Декабрь" -> {"Зима"}
        "Март", "Апрель", "Май" -> {"Весна"}
        "Июнь", "Июль", "Август" -> {"Лето"}
        "Сентябрь", "Октябрь", "Ноябрь" -> {"Осень"}
        else -> {"Некоректный месяц"}
    }


    season = when(monthIndex){
        12, 1, 2 -> {"Зима"}
        in 3..5 -> {"Весна"}
        6, 7, 8 -> {"Лето"}
        in 9..11 -> {"Осень"}
        else -> {"Некоректный месяц"}
    }
    println(season);
}

